# Задача 3. Вариант 13. 
# Напишите программу, которая выводит имя "Норма Бейкер", и запрашивает его псевдоним. 
#Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и 
#псевдоним с помощью тире.


# Suchkov R.A. 
# 28.02.2017


name = input ('Под каким псевданимом известна Норма Бейкер (Мерлин Монро)?')
print ('Норма Бейкер-',name)
print ('\a')
input ('\n\n')
