# Задача 1. Вариант 13. 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под 
#которым скрывается Мария Луиза Полякова — Байдарова. После вывода 
#информации программа должна дожидаться пока пользователь нажмет Enter для 
#выхода. 


# Suchkov R.A. 
# 21.02.2017 

print("Мария Луиза Полякова") 
print("Род деятельности: актриса,певица") 
print("Псевдоним - Катрин Марина де Полякофф-Байдарофф") 
input ("\n\n")
