# Задача 4. Вариант 13. 
# Напишите программу, которая выводит имя, под которым скрывается Жан Батист Поклен. 
#Дополнительно необходимо вывести область интересов указанной личности, место рождения, 
#годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или
#момент смерти). Для хранения всех необходимых данных требуется использовать переменные
#После вывода информации программа должна дожидаться пока пользователь нажмет Enter 
#для выхода


# Suchkov R.A. 
# 28.02.2017



print ('Жан-Батист Поклен известен как французский комедиограф XVII века')
print ('Область интересов: театр')
print ('Место рождения: Париж, Франция')
print ('Годы жизни: 15.01.1622-17.02.1673 \a')
print ('Возраст: 51 год')
input ('\n\n\nнажмет Enter для выхода.')
