# Задача 2. Вариант 13. 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам
#высказывание, автором которого является Саади Ширази. Не забудьте о том,
#что автор должен быть упомянут на отдельной строке.


# Suchkov R.A. 
# 21.02.2017

print ('Внимай речам ученого человека с величайшим вниманием,')
print ('хотя бы дела его не соответствовали его учению. ')
print ('Человек должен учиться, хотя бы поучение было написано на стене.')
print ()
print ()
print ('Саади Ширази')
input ()
