# Задача 1. Вариант 0.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдсон Арантис ду Насименту. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Krasnikov A. S.
# 01.02.2016

print("Эдсон Арантис ду Насименту более известен, как бразильский футболист Пеле.")

input("\n\nНажмите Enter для выхода.")
