# Задача 2. Вариант 0.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Ф.М.Достоевский. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Krasnikov A. S.
# 01.02.2016

print("Жизнь, везде жизнь, жизнь в нас самих, а не во внешнем.")

print("\n\t\t\t\t\tФ.М.Достоевский")

input("\n\nНажмите Enter для выхода.")
