# Задача 1. Вариант 20.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Евгений Петрович Катаев. После вывода информации
# программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Смирнов Владимир Алексеевич
# 30.10.2019

print("Евгений Петрович Катаев более известен, как российский писатель-сатирик Евгений Петров.")
input("\n\nНажмите Enter для выхода.")
