# Задача 2. Вариант 20.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Иннокентий (Борисов). Не забудьте
# о том, что автор должен быть упомянут на отдельной строке.

# Смирнов Владимир Алексеевич
# 30.10.2019

print("\"Ум человеческий, любящий расширяться в своих умозрениях, особенно в отношении к свободе, хвалится обширностию "
      "своих видов, всеобъемлемостью предначертаний. И что же? Ни один из самых пламенных мечтателей о свободе "
      "не осмелился доселе, даже хотя бы в мыслях, простерть ее туда, куда простирает Евангелие.\""
      "\n\n Иннокентий (Борисов)")
input("\n\nНажмите Enter для выхода.")
