# Задача 3. Вариант 20.
# Напишите программу, которая выводит имя "Мария Магдалена фон Лош", и
# запрашивает его псевдоним. Программа должна сцеплять две эти строки и
# выводить полученную строку, разделяя имя и псевдоним с помощью тире.

# Смирнов Владимир Алексеевич
# 30.10.2019

print("Мария Магдалена фон Лош\n"
      "Под каким же именем мы знаем этого человека? Ваш ответ:", end='')
answer = input()
print("Мария Магдалена фон Лош - " + answer)

input("\n\nНажмите Enter для выхода.")
